init:
    $ mods["testckodingc_elprimovosem"]=u"Тесты с Кодингом"
    $ tv = Character (u'Кирилл', color="00ea32", what_color="E2C778",)
    $ nn = Character (u'Незнакомец', color="72a0ff", what_color="E2C778",)
    $ nv = Character (u'Незнакомка', color="a5a5ff", what_color="E2C778",)
    image bussxolod = "mods/testckodingc/bg/bussxolod.png"
    image ostahobka = "mods/testckodingc/bg/ostahobka.png"
    image podzezd = "mods/testckodingc/bg/podzezd.png"
    image xolod = "mods/testckodingc/bg/xolod.png"
    image ylisa = "mods/testckodingc/bg/ylisa.png"
    image black = "mods/testckodingc/bg/black.png"
    image son = "mods/testckodingc/bg/son.png"
    image silyet = "mods/testckodingc/bg/silyet.png"
    $ music_august = "mods/testckodingc/sound/august.mp3"
    $ music_alone = "mods/testckodingc/sound/alone.mp3"


label testckodingc_elprimovosem:
    scene bg semen_room with dissolve
    play music music_august fadein 1
    "Уже стемнело... сказал я себе это вставая с кровати."
    "Осмотрев свою комнату я понял ,что  выглядит она как большая свалка из всякой всячины."
    tv "И Когда я успел сделать такой бардак?"
    tv "Ведь все было чисто и выглядело нормально, до одного момента."
    tv "Момента погружения в апатию и проблемы."
    "День за днем проходили незаметно. Настолько незаметно, что на эту свалку у себя дома я заметил только сейчас."
    "Я перестал следить за своим телом. Да, что там за телом,"
    "я банально перестал умываться и чистить свои зубы."
    "У меня стали появляться морщины и стала расти борода."
    "Сейчас я был похож на старика лет 50 если не больше."
    tv "Всё время просто ничего не делал. Употреблял пищу, спал, сидел в компьютере и тратил свои сбережения."
    "От небольших мыслей про еду живот дал мне знать, что пора что-то в него запустить и обязательно съедобное. "
    "Встав с кровати я подошел к своему уже сильно пыльному холодильнику и открыл его."
    scene xolod with dissolve
    "Говорить что он полон не было никого смысла."
    "В нем лежал, по-видимому, уже просроченный йогурт и сосиска, она казалась более-менее свежей, но взять ее я всё-таки не решился."
    "Моём рационе постоянно была еда из доставок в частности вредная еда."
    "Лапша быстрого приготовления, бургеры и так далее."
    "Всё время я питался только этим, изредка заказывая алкоголь , чтобы упиться и хоть чуть-чуть не вспоминать свою прошлую жизнь."
    scene bg semen_room with dissolve
    tv "Чем больше я мыслю , тем больше мне хочется есть."
    tv "Когда-нибудь я точно перестану разговаривать с собой,но точно не сейчас."
    tv "Сейчас стоит понять где мне взять хоть немного денег хотя-бы на доширак. Может посмотреть в кошелёк?"
    tv "Да, точно! Первым делом надо заглянуть в кошелек там может быть хоть немного денег."
    tv " Ведь все накопленные деньги я снял в первый день положил их на стол, и просто тратил не задумываясь, что я буду делать дальше если они закончатся."
    tv "Осталось лишь найти кошелек и поверить на свою удачу."
    "Стоя по середины моей комнаты, я огляделся внимательно, посмотрел на всё и конечно же на то, что успело накопиться у меня на свалке."
    "Глазами я пробегал каждый уголок своей комнаты, параллельно думая куда я мог его положить."
    tv "Ах, вот же он!"
    "Кошелек нашелся на тумбе перед пустой бутылкой минеральной воды."
    "В нем лежало сто рублей купюрой, еще было мелочью порядка рублей тридцати."
    tv "Джекпот!"
    "Меня это порадовало, даже на миллисекунду я почувствовал радость и капельку того счастья, что когда-то было."
    "Я уже не раз задавался вопросом, почему и когда я его потерял?"
    "Эх... все никак не мог смириться с этими потерями."
    "Бросили и оставили одного на произвол судьбы. Кому-то точно знакомо чувство когда человек являлся для тебя вселенной, или даже всем миром."
    "Случилось вроде как самое обычное предательство какое могло быть и она просто ушла к другому человеку."
    "Никогда не забуду ее слов Успокойся, все в порядке. Я всегда рядом"
    "Эти слова очень помогали в трудные моменты. Пусть они и звучали смазливо, как ей казалось, но мне было очень приятно слышать их."
    "Эти слова так впивались душу всё сильнее принося боль. Спустя время я так и не понял, что сделал не так."
    "Боролся с этими мыслями, чувствами и эмоциями до момента увольнения с работы. Моя работа оставалась последним, что мне приносило счастье, удовольствие, да, и деньги тоже."
    "Поговорить, обсудить это с кем-то я просто не мог. Мое общение заканчивалось знакомыми по работе или интернетом. Про психологов я тогда не думал, вряд ли бы их помощь мне помогла."
    "Жил я с бабушкой до поры когда и ее не стало в мои девятнадцать лет."
    "Родителей у меня не было, они умерли в автокатастрофе когда мне было шесть лет."
    "Квартира досталась от нее, но заселиться я смог в нее только год назад."
    "Повзрослеть мне пришлось быстрее чем хотелось бы, поэтому и детства у меня особо не было."
    "Всё что у меня было раньше оставалось последней надеждой в моей жизни."
    "Потеряв самое важное я погрузился в себя, было уже плевать на всех и вся в этом мире."
    "не уже двадцать два года  и сейчас я живу, нет, выживаю в свалке своего имени."
    tv "Я так устал от этой жизни"
    show blink
    "Одевался я не спеша,было слишком мало сил что-то делать,была только лень."
    show unblink
    "Я взял первые попавшиеся носки, которые вроде пахли не столь плохо."
    "Надел штаны, черную рубашку и накинул на себя свое старое пальто."
    "Наконец через десять минут я переступил через порог своего дома."
    scene podzezd with dissolve 
    scene ylisa with dissolve
    "На улице уже во всю царила зима, улицы светились будто сейчас не вечер, а утро."
    "Метель и этот мёрзлый ветер, от которого мурашки по коже говорили, что зима в этом году будет очень суровой."
    tv "Нужно было одеть мне шапку..."
    "Не успел я пройти и 50 метров как вдруг меня кто-то остановил положив руку на мое плечо."
    stop music
    "Мне стало не по себе и с полной увереностью мог сказать , что знатно испугался."
    play music music_alone fadein 2
    nn "Не поворачивайся стой, как стоял."
    tv "В чем же собственно проблема?"
    "Голос этого незнакомца был очень странный , будто со мной говорит не человек , а что-то иное."
    "Ослушиваться я его не стал, но в этот момент хотелось убежать очень далеко."
    nn "Мне нужна твоя помощь."
    tv "Что? Я тебя не понял."
    "Незнакомый голос стал более напряженным."
    nn "Мне нужна твоя помощь, поможешь мне и всё станет на свои места."
    tv "Смотря с чем тебе нужно помочь и зачем говорить это за моей спин..."
    "Не успев договорить незнакомец отвечает мне."
    nn "Для их же безопасности."
    tv "Хорошо, а их это кого?"
    nn "Она тебе не сказала... теперь понятно почему ты стал жить такой мрачной жизнью."
    nn "С другой стороны это даже лучше, для тебя все будет в новинку,а значит найти юлю для тебя не составит никаких проблем."
    tv "Какую еще юлю?"
    nn "Прошу не задавай сейчас глупых вопросов,мне нельзя долго с тобой говорить,узнаешь все по ходу."
    tv "Мне кажется это самый обычный вопрос."
    nn "Для прошлого тебя может и обычный,но точно не сейчас."
    nn "Времени мало поэтому слушай внимательно."
    nn "Сейчас ты отказываешься от похода в магазин идешь на остановку, садишься в автобус под номером 410 и стараешься заснуть."
    nn "После найди юлю она тебе все расскажет и даст ответы на все твои вопросы."
    tv "Где мне ее искать? И как мне тебе верить, что меня не на продажу органов увезут?"
    nn "Поверь на слово, от этого зависит не только твоя жизнь,но и жизни других людей."
    nn "Не могу знать где она,но точно знаю кто тебе в этом поможет."
    nn "По приезду на место в тебе кое-что измениться,это то что сможет тебе помочь."
    nn "Извини что говорю загадками, нас могли подслушивать мне еще слишком повезло , что я нашел тебя первым."
    tv "Я постараюсь сделать все что в моих силах."
    nn "Сохрани нас..."
    "Мое плечо почувствовало облегчение, но напряжение совсем не спадало."
    "Повернувшись за собой я увидел лишь другую сторону улицы, как будто никого там и не было."
    tv "Что за бред я сейчас услышал?"
    tv "Что за юля? Кто она такая? И на что я вообще подписался?"
    "Вопросов становилось больше и больше, ответов на которые видимо ближайшее время не получу."
    "Долго думать мне не пришлось, наконец уже решив идти в неизвестность я направился к остановке."
    scene ostahobka with dissolve
    "Была она близко, через две минуты я уже стоял около неё,"
    scene bussxolod with dissolve
    "как и тот самый автобус."
    scene bg intro_xx with dissolve
    "Заходил в него я аккуратно пытаясь понять в чем подвох. Автобус выглядел совершенно обычно, такой же как другие, ну чуть-чуть старенький был, в остальном выглядел так же. Совершенно пустой автобус, если не считать водителя."
    "Я уселся на самое дальнее сиденье пытаясь не привлекать внимание."
    play sound sfx_bus_interior_moving 
    "Подождав еще около пятнадцати минут попутно размышляя, что меня ждет двери автобуса закрылись и он тронулся."
    $ set_mode_nvl()
    "В окнах мелькали машины и люди ждавшие своего сигнала. Все куда-то спешат, суетятся и живут. Каждый вертеться как может, а если не может, то теряется пучине проблем и  теряет способность решать проблемы. Благодаря проблемам мы бежим по линии своей жизни,боремся за нее обгоняее других. Стараемся из-за всех сил,иногда спотыкаемся,но поднявшись бежим дальше, встречаем всё больше людей с которыми продолжим преодолевать проблемы вместе. В итоге приходим к тому концу который сами заслужили. Может это глупо? Я не знаю,ведь упрекнуть меня не кому. Никто мне ничего против не скажет. Размышлять над этим можно было долго, но гробовая тишина в автобусе, она заставляла меня зевать, одно лишь гудение мотора работало как колыбельная. Лишь вслушиваясь в каждый его треск и гудение, я стал засыпать уже не думая о месте куда меня везут, ни о том голоде, что вроде когда-то был..."
    $ set_mode_adv()
    stop sound
    show blink
    
    $ backdrop = "days"
    $ new_chapter(1, "День первый")
    
    scene son with dissolve 
    nv "Ты такой у меня милый,прям бы затискала тебя до смерти."
    tv "Я тоже..."
    "Мне было не описать как я ее люблю, весь мой мир лежит сейчас рядом со мной и греет мою душу."
    "Не просто греет, а обжигает,заставляя сердце биться чаще."
    "Я заплакал, не знаю почему, я просто заплакал у нее на груди."
    "Это был первый раз когда я заплакал при ней и последний..."
    nv "Я хочу тебе кое что сказать,слушай внимательно,это важно."
    nv "В тот момент я была не права и поступила как последняя дура. Не хотелось чтобы всё вот так вышло, но что случилось, то случилось, назад все не вернуть."
    nv "Прости меня за то , что не сказала,но я знала какого тебе будет. У нас теперь другие жизни, а твоей дан второй шанс, поэтому прошу тебя только об одном. Не пропусти этот шанс и найди свое настоящее счастье."
    tv "Что...?"
    "Поцеловав меня на прощанье она просто растворилась в пустоте,а в моей комнате всё стало заполняться чернотой."
    scene black with dissolve 
    "Было страшно,но всё произошло так быстро,буквально за секунду,в ушах резко зазвенело."
    scene bg int_bus with dissolve
    "В глаза ударил резкий солнечный свет."
    "Первым, что я успел сделать, это схватить рукой свое колющее вглубь души сердце."
    tv "Фух... это был всего-лишь сон."
    tv "Но чёрт, почему любовь приносит столько боли, у меня уже нет сил терпеть это."
    tv "Как мне тебя отпустить?!"
    "крикнул я в пол голоса."
    tv "Хочется забиться калачиком в какой-нибудь уголок и просто плакать."
    voice "Хватит с тебя нытья, ведешь себя постоянно как тряпка."
    voice "Тебе дали шанс, так воспользуйся им."
    tv "Что ты такое? И что ты забыл в моей голове?"
    voice "Твой внутренний гость и помощник на какое-то время."
    tv "Ну класс и какое время этот гость будет сидеть у меня в голове?"
    voice "Увидим,честно я сам не знаю."
    tv "Утешил,хотя какая разница,теперь хоть не сам с собой буду говорить."
    "Голос в голове лишь усменулся,но ничего не сказал."
    "Автобус выглядел гораздо новее, чем тот в который я садился. А из окна виднелась зеленая травка и голубое небо."
    tv "Зима ведь была, откуда лето?"
    voice "Мне откуда знать,я вместе с тобой проснулся."
    voice "И давай выйдем от сюда, жарко слишком."
    tv "Соглашусь тут ужасно жарко такими темпами можно и солнечный удар получить прямо тут."
    tv "Кстати тебе мои ощущения тоже что-ли передаются?"
    voice "Да, перестань уже задавать столько вопросов и выйди на улицу."
    tv "Не нуди,мне было интересно."
    scene bg ext_bus with dissolve
    "Выйдя из автобуса предо мной показалась самая настоящая красота в виде зеленой травы,пения птиц и палящих лучей солнышка."
    "Вдохнув полную грудь свежего воздуха, я начал чувствовать себя гораздо лучше."
    "Позади меня уже во всю красовались ворота с надписью совенок,а по бокам стояли каменные пионеры."
    scene bg ext_camp_entrance_day with dissolve
    tv "Пионер лагерь?"
    voice "Он самый, настоящий"
    tv "Пионер лагерь я меньше всего ожидал здесь увидеть."
    show sl pioneer surprise far with dissolve
    "Из ворот совенка показалась девушка в пионерской форме и cветлыми волосами."
    "Заговорить с ней первым я не решился, поэтому она сделала это сама."
    show sl pioneer smile2 with dissolve
    nv "Привет! Ты наконец-то приехал, мы тебя весь день ждали."
    "От девушки веяло наивной добротой и опасной она не казалась."
    "Но...её глаза,да, глаза стесняли меня в моменте."
    tv "П-привет. Да...вот только приехал."
    "Сказать что-то больше этих слов смелости у меня нехватило."
    show sl pioneer sad with dissolve
    "Эй,ну ты чего такой стеснительный? Меня славянной зовут,но все обычно называют славя и ты зови."
    tv "Хорошо, я учту это и запомню!"
    show sl pioneer laugh with dissolve
    sl "Вот такой настрой мне нравится."
    tv "Я в общем это... первый раз в лагере нахожусь."
    "Почесав свой затылок, я заставил славю улыбнуться"
    show sl pioneer happy with dissolve
    sl "Что же, добро пожаловать! Я рада что ты попал именно к нам."
    sl "Тебе к вожатой надо, она тебе расскажет чем мы тут занимаемся. Ты сам сможешь к ней найти дорогу?"
    tv "Надеюсь на это. А куда нужно идти?"
    show sl pioneer normal with dissolve
    sl "Смотри. Сейчас идешь прямо-прямо до площади и потом  повернешь налево, увидишь домик с треугольной крышей его ни с чем не перепутаешь."
    "Славя показала в сторону ворот."
    sl "Всё понял?"
    tv "Думаю да."
    "На самом деле я прослушал половину слов глядя на ворота куда показывала Славя.~"
    sl "Ну все я побежала, до встречи!"
    scene bg ext_camp_entrance_day with dissolve
    "Девушка помахала рукой и скрылась за воротами."
    voice "Ну что-ж давай посмотрим, что нам уготовила судьба."
    "Плетясь по лагерю я разглядывал всё, что только можно. Деревья и птичек перелетающих с ветки на ветку. Кусты по которым бегали божьи коровки. Траву на которой только не давно была роса и многое многое другое."
    "Антураж местности был очень привлекательным и красивым"
    "Особенно для меня, как человека не выходившего на улицу очень долгое время."
    "Из моих небольших мыслей меня вывел мой новый знакомый."
    voice "Может не будем тратить время просто так и доберемся до вожатой?"
    tv "Вот умеешь ты всё портить."
    scene silyet with dissolve
    "Продолжив свой путь к площади я остановился около одного из зданий. Перед глазами Кирилла мелькнуло два силуета похожих на девушек."
    scene bg ext_clubs_day with dissolve
    voice "Что на этот раз?"
    tv "А ты не видел? "
    voice "Нет. Что я должен был увидеть?"
    tv "Ай, показалось значит."
    voice "Мы с тобой две разных личности, если кажется тебе, не значит, что будет казаться мне."
    voice "Меня просто поместили в твой мозг, я чуствую что и ты, а также могу думать, как обычный человек."
    tv "Значит я официально могу себя называть человеком с шизофринией?"
    voice "Могу только сказать, что сейчас это назвать раздвоением личности. Но давай об этом поговорим потом, у нас еще будет время."
    play sound sfx_close_door_1
    show el pioneer smile far with dissolve
    "Из дверей здания вышел незнакомый парень на вид лет 17."
    "Заметив Кирилла он не думая подошел к нему."
    show el pioneer smile with dissolve
    nn "О! Привет, ты новенький?"
    tv "Ну...да."
    el "Тогда давай знакомиться, меня Электроник зовут."
    "Протянув свою руку начал знакомиться он."
    tv "Кирилл."
    "Не долго думая я ответил положительно на его предложение пожать мне руку"
    "Вообще меня Серёга звать, но обычно электроником кличат, Ульянка иногда Сыроежкой меня называет. Ну фамилия у меня такая Сыроежкин. "
    tv "Ну будем знакомы."
    el "А я смотрю ты не многословен,ладно, было приятно познакомиться Кирилл."
    el "Как ты мог заметить у нас тут клубы. Я со своим другом Шуриком всякими разными делами занимаюсь."
    show el pioneer normal with dissolve
    el "Ой,чуть не забыл. Ты случайно не видел двух девочек тут минут 10 назад?"
    tv "Нет, таких не видел. Я это... пойду наверное, мне к вожатой надо."
    el "Ладно, сам их найду тогда."
    "Я молча кивнул."
    el "Кстати,а ты знаешь-то где вожатая находиться?"
    tv "Мне Славя рассказала куда идти, но честно я прослушал половину слов."
    show el pioneer smile with dissolve
    tv "Помню только,что мне надо прямо до площади, а потом толи направо, толи налево и там будет домик с треугольной крышей."
    el "Почти правильно, тебе налево если что. Ну тогда давай я пошел, увидимся"
    tv "Пока."
    "Больше двух знакомств за последний час, мой мозг не выдержит столько информации."
    scene bg ext_square_day with dissolve
    voice "Вот до площади добрались. Осталось не отвлекаться на всех и вся и дойти до вожатой."
    tv "А тут неплохо, все так чистенько."
    voice "Что я тебе говорил 5 минут назад?"
    tv "Да,всё,всё. Понял я, не отвлекаемся и идем к вожатой."
    
    
    
    
    



    
    
    
    
    
    
    
    
    
    


    
    
    
    
    
    
    

    